#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infrastructure/azure/prod relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/portfolio-website/portfolio-website/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/portfolio-website/portfolio-website

To view this run in a browser, visit:
https://app.terraform.io/app/sivonte/portfolio-prod/runs/run-zxhepoFSmYsWqwpH

Waiting for the plan to start...

Terraform v1.14.5
on linux_amd64
Initializing plugins and modules...
module.resource_group.azurerm_resource_group.this: Refreshing state... [id=/subscriptions/256c5490-15a5-4ab2-8f9a-1ee479c28d6c/resourceGroups/rg-portfolio-prod]
module.monitor.azurerm_monitor_action_group.developers_group: Refreshing state... [id=/subscriptions/256c5490-15a5-4ab2-8f9a-1ee479c28d6c/resourceGroups/rg-portfolio-prod/providers/Microsoft.Insights/actionGroups/ag-developers-portfolio-prod]
module.application_insights.azurerm_log_analytics_workspace.this: Refreshing state... [id=/subscriptions/256c5490-15a5-4ab2-8f9a-1ee479c28d6c/resourceGroups/rg-portfolio-prod/providers/Microsoft.OperationalInsights/workspaces/log-portfolio-prod]
module.dns_zone.azurerm_dns_zone.this: Refreshing state... [id=/subscriptions/256c5490-15a5-4ab2-8f9a-1ee479c28d6c/resourceGroups/rg-portfolio-prod/providers/Microsoft.Network/dnsZones/sivonte.com]
module.dns_zone.azurerm_dns_a_record.this: Refreshing state... [id=/subscriptions/256c5490-15a5-4ab2-8f9a-1ee479c28d6c/resourceGroups/rg-portfolio-prod/providers/Microsoft.Network/dnsZones/sivonte.com/A/@]
module.static_web_app.azurerm_dns_cname_record.this: Refreshing state... [id=/subscriptions/256c5490-15a5-4ab2-8f9a-1ee479c28d6c/resourceGroups/rg-portfolio-prod/providers/Microsoft.Network/dnsZones/sivonte.com/CNAME/www]
module.static_web_app.azurerm_dns_txt_record.this: Refreshing state... [id=/subscriptions/256c5490-15a5-4ab2-8f9a-1ee479c28d6c/resourceGroups/rg-portfolio-prod/providers/Microsoft.Network/dnsZones/sivonte.com/TXT/@]
module.application_insights.azurerm_application_insights.this: Refreshing state... [id=/subscriptions/256c5490-15a5-4ab2-8f9a-1ee479c28d6c/resourceGroups/rg-portfolio-prod/providers/Microsoft.Insights/components/appi-portfolio-prod]
module.monitor.azurerm_monitor_smart_detector_alert_rule.failure_anomalies: Refreshing state... [id=/subscriptions/256c5490-15a5-4ab2-8f9a-1ee479c28d6c/resourceGroups/rg-portfolio-prod/providers/Microsoft.AlertsManagement/smartDetectorAlertRules/ar-failure-anomalies-portfolio-prod]
module.dns_zone.azurerm_dns_a_record.this: Drift detected (update)
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "ARM_CLIENT_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-zxhepoFSmYsWqwpH/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "ARM_CLIENT_SECRET" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-zxhepoFSmYsWqwpH/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│
│ In addition to the other similar warnings shown, 2 other variable(s)
│ defined without being declared.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.dns_zone.azurerm_dns_a_record.this will be updated in-place
  ~ resource "azurerm_dns_a_record" "this" {
        id                  = "/subscriptions/256c5490-15a5-4ab2-8f9a-1ee479c28d6c/resourceGroups/rg-portfolio-prod/providers/Microsoft.Network/dnsZones/sivonte.com/A/@"
        name                = "@"
        tags                = {}
      + target_resource_id  = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.static_web_app.azurerm_dns_cname_record.this will be updated in-place
  ~ resource "azurerm_dns_cname_record" "this" {
        id                  = "/subscriptions/256c5490-15a5-4ab2-8f9a-1ee479c28d6c/resourceGroups/rg-portfolio-prod/providers/Microsoft.Network/dnsZones/sivonte.com/CNAME/www"
        name                = "www"
      ~ record              = "gentle-moss-02abded03.2.azurestaticapps.net" -> (known after apply)
        tags                = {}
        # (5 unchanged attributes hidden)
    }

  # module.static_web_app.azurerm_dns_txt_record.this will be updated in-place
  ~ resource "azurerm_dns_txt_record" "this" {
        id                  = "/subscriptions/256c5490-15a5-4ab2-8f9a-1ee479c28d6c/resourceGroups/rg-portfolio-prod/providers/Microsoft.Network/dnsZones/sivonte.com/TXT/@"
        name                = "@"
        tags                = {}
        # (4 unchanged attributes hidden)
    }

  # module.static_web_app.azurerm_static_web_app.this will be created
  + resource "azurerm_static_web_app" "this" {
      + api_key                            = (sensitive value)
      + configuration_file_changes_enabled = true
      + default_host_name                  = (known after apply)
      + id                                 = (known after apply)
      + location                           = "westeurope"
      + name                               = "stapp-portfolio-prod"
      + preview_environments_enabled       = true
      + public_network_access_enabled      = true
      + resource_group_name                = "rg-portfolio-prod"
      + sku_size                           = "Free"
      + sku_tier                           = "Free"
      + tags                               = {
          + "Environment" = "prod"
          + "Management"  = "Terraform Cloud - Remote"
          + "Owner"       = "sivonte"
          + "Project"     = "portfolio"
        }
    }

  # module.static_web_app.azurerm_static_web_app_custom_domain.main will be created
  + resource "azurerm_static_web_app_custom_domain" "main" {
      + domain_name       = "sivonte.com"
      + id                = (known after apply)
      + static_web_app_id = (known after apply)
      + validation_token  = (sensitive value)
      + validation_type   = "dns-txt-token"
    }

  # module.static_web_app.azurerm_static_web_app_custom_domain.sub will be created
  + resource "azurerm_static_web_app_custom_domain" "sub" {
      + domain_name       = "www.sivonte.com"
      + id                = (known after apply)
      + static_web_app_id = (known after apply)
      + validation_token  = (sensitive value)
      + validation_type   = "cname-delegation"
    }

Plan: 3 to add, 3 to change, 0 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 11 estimated
           $0.0/mo +$0.0

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @krzysztoftalar, Action: `pull_request`, Working Directory: `infrastructure/azure/prod`, Workflow: `Deploy Infrastructure to Azure`*